app/controllers/channels_controller.rb

  def index
    @channels = Channel.all
---
SELECT `channels`.* FROM `channels`

  def create
    @channel = Channel.new(channel_params)

    respond_to do |format|
      if @channel.save
---
INSERT INTO `channels` (`channel_name`, `created_at`, `updated_at`) VALUES ('Facebook', '2016-01-28 10:18:42', '2016-01-28 10:18:42')

    def set_channel
      @channel = Channel.find(params[:id])
---
SELECT  `channels`.* FROM `channels` WHERE `channels`.`id` = 1 LIMIT 1