app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT `projects`.* FROM `projects`

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO `projects` (`project_name`, `project_description`, `user_id`, `created_at`, `updated_at`) VALUES ('secondproject', 'second project description', 1, '2016-01-19 06:28:40', '2016-01-19 06:28:40')

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE `projects` SET `project_name` = 'testangular34', `project_description` = 'testangular34', `updated_at` = '2016-01-19 10:17:00' WHERE `projects`.`id` = 2

    def set_project
      @project = Project.find(params[:id])
---
SELECT  `projects`.* FROM `projects` WHERE `projects`.`id` = 4 LIMIT 1