app/controllers/scheduler_types_controller.rb

  def index
    @scheduler_types = SchedulerType.all
---
SELECT `scheduler_types`.* FROM `scheduler_types`

  def create
    @scheduler_type = SchedulerType.new(scheduler_type_params)

    respond_to do |format|
      if @scheduler_type.save
---
INSERT INTO `scheduler_types` (`scheduler_name`, `created_at`, `updated_at`) VALUES ('Only Once', '2016-01-28 10:41:45', '2016-01-28 10:41:45')

    def set_scheduler_type
      @scheduler_type = SchedulerType.find(params[:id])
---
SELECT  `scheduler_types`.* FROM `scheduler_types` WHERE `scheduler_types`.`id` = 1 LIMIT 1