app/controllers/source_socials_controller.rb

INSERT INTO `source_socials` (`collection_name`, `fb_like_page_id`, `access_token`, `fb_feed_limit`, `consumer_key`, `consumer_secret`, `access_secret`, `geo_lat`, `geo_lon`, `twitter_hastags`, `instagram_tags`, `project_id`, `channel_id`, `created_at`, `updated_at`) VALUES ('UOBFB2', 'asdsa', 'dsadasda', 11, '', '', '', '', '', '', '', 15, 1, '2016-02-03 12:46:14', '2016-02-03 12:46:14')
---
  def create

    @source_social = SourceSocial.new(source_social_params)
    respond_to do |format|
      if @source_social.save

UPDATE `source_socials` SET `collection_name` = 'UOBFB1', `updated_at` = '2016-02-03 11:17:19' WHERE `source_socials`.`id` = 1
---
  def update
    respond_to do |format|
      if @source_social.update(source_social_params)

SELECT  `source_socials`.* FROM `source_socials` WHERE `source_socials`.`id` = 1 LIMIT 1
---
    def set_source_social
      @source_social = SourceSocial.find(params[:id])