app/controllers/source_webs_controller.rb

SELECT `source_webs`.* FROM `source_webs`
---
  def index
    @source_webs = SourceWeb.all

INSERT INTO `source_webs` (`url_collection_name`, `url_collection`, `created_at`, `updated_at`) VALUES ('uob', 'http://wew.vom', '2016-01-28 19:19:45', '2016-01-28 19:19:45')
---
  def create
    @source_web = SourceWeb.new(source_web_params)

    respond_to do |format|
      if @source_web.save

DELETE FROM `source_webs` WHERE `source_webs`.`id` = 1
---
  def destroy
    @source_web.destroy

SELECT  `source_webs`.* FROM `source_webs` WHERE `source_webs`.`id` = 1 LIMIT 1
---
    def set_source_web
      @source_web = SourceWeb.find(params[:id])